FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ОписаниеПоследовательностейСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОписаниеПоследовательностейСобытий</Name>
			<Comment>Описние последовательностей событий</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Последнее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетПовторяться</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетБытьПервым</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОчередныеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСобытия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриНаличии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриОтсутствии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируетсяПриНаличии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ОписаниеПоследовательностейСобытий/Ext/ManagerModule.bsl
Функция ПоследнееСобытие(ВидСобытия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОписаниеПоследовательностейСобытий.ВидСобытия
	               |ИЗ
	               |	Справочник.ОписаниеПоследовательностейСобытий КАК ОписаниеПоследовательностейСобытий
	               |ГДЕ
	               |	ОписаниеПоследовательностейСобытий.Последнее = ИСТИНА
	               |	И ОписаниеПоследовательностейСобытий.ВидСобытия = &ВидСобытия";
	
	Запрос.УстановитьПараметр("ВидСобытия",ВидСобытия);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции
